#ЗАДАЧА2
# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
#Вариант 1
# list = [2, 3, 4, 5, 6]
# i = 0
# j = 1
# while i < ((len(list)/2)):
#     result = list[i] * list[(len(list)-j)]
#     print(result, end=" ")
#     i+= 1
#     j+= 1


#Вариант2
list = [2, 3, 5, 6]
result = []
for i in range((len(list)+1)//2):
    result.append(list[i] * list[(len(list)-1-i)])
print(result)